p1=int(input())

if p1==1:print ("x принимает значения от 0 до бесконечности, \n y принимает значения от 0 до бесконечности")
elif p1==2:print ("x принимает значения от 0 до -бесконечности, \ny принимает значения от 0 до бесконечности")
elif p1==3:print ("x принимает значения от 0 до -бесконечности, \n y принимает значения от 0 до -бесконечности")
elif p1==4:print ("x принимает значения от 0 до бесконечности, \n y принимает значения от 0 до -бесконечности")
else: print ('введите значение от 1 до 4')